# GetFlangeThicknessInFlangeCenter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT..::..GetFlangeThicknessInFlangeCenter Method
StructuralSectionGeneralT Class See Also
---
Returns thickness of flange measured in the 0.25 * (width - webThickess), sometimes used for sections with width > 300 mm.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetFlangeThicknessInFlangeCenter()
```

Visual Basic
---
```text
Public Function GetFlangeThicknessInFlangeCenter As Double
```

Visual C++
---
```text
public:
double GetFlangeThicknessInFlangeCenter()
```

# See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace